weights = {
   1:{7: 1.8, 8: 0.6},# רמת מיקוד וסבלנות
   2:{1: 2.0, 2: 0.8},# ביטחון עצמי לפי רוחב הפנים
   3:{5: 1.9},# כושר שיפוט
   4:{5: 1.8, 6: 1.2},# תפיסה ביקורתית / עיגול פינות
   5:{6: 1.5, 2: 1.1},# בררנות / חביבות
   6:{2: 1.7, 5: 1.4},# רמת עצמאות
   7:{4: 1.9, 8: 1.5, 3: 1.8, 7: 1.4, 4: 1.6},# אופטימיות / פסימיות
   8:{4: 1.7, 5: 1.6, 3: 1.6, 8: 1.2},# מניע שכלי / גופני
   9:{7: 1.6, 6: 1.3},# יכולת ניהול / מתן שירות וטיפול
   10:{7: 1.8, 8: 1.8},# כובד ראש ורצינות / קלילות
   11:{8: 1.9},# פזיזות
   12:{6: 2.0, 2: 1.7},# רגישות גבוהה, עדינות
   13:{6: 2.0, 1: 1.6,2: 1.5},# ביטוי רגשי גבוה / אדישות 
   14:{1: 2.0, 2: 1.2},# אדם חם ולבבי / עסוק בעצמו
   15:{6: 1.7, 5: 1.3},# רגיש / לא רגיש לביקורת
   16:{7: 1.7, 5: 1.5},# נחישות גבוהה / נמוכה
   17:{7: 1.6},# רמת זהירות
   18:{3: 1.8, 7: 1.4},# ירידה ודאגה לפרטים
   19:{3: 1.2},# זיכרון חזותי
   20:{6: 1.3}# תמימות
}
